datomusic/duo-imxrt/platform/brains2/components/osa/fsl_os_abstraction_bm.c
    list_element = LIST_GetHead(&s_osaState.taskList);
    while (list_element != NULL)
    {
        list_element = LIST_GetHead(&s_osaState.taskList);
        while (NULL != list_element)
        {
            tcb                       = (task_control_block_t *)(void *)list_element;
            s_osaState.curTaskHandler = (osa_task_handle_t)tcb;
            if (0U != tcb->haveToRun)
            {
                if (NULL != tcb->p_func)
                {
                    tcb->p_func(tcb->param);
                }
                list_element = LIST_GetHead(&s_osaState.taskList);
            }
            else
            {
                list_element = LIST_GetNext(list_element);
            }
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskShouldYield
 * Description   : When this function returns TRUE, an OSA task  has to run
 *
 *END**************************************************************************/
uint8_t OSA_TaskShouldYield(void)
{
    list_element_handle_t list_element;
    uint8_t status = 0;
    task_control_block_t *tcb;

    list_element = LIST_GetHead(&s_osaState.taskList);
    while ((list_element != NULL))
    {
        tcb = (task_control_block_t *)(void *)list_element;
        if (1U == tcb->haveToRun)
        {
            status = 1U;
            break;
        }
        list_element = LIST_GetNext(list_element);
    }
    return status;
}
#endif

/*FUNCTION**********************************************************************
 *
 * Function Name : SysTick_Handler
 * Description   : This ISR of the SYSTICK timer.
 *
 *END**************************************************************************/
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
void SysTick_Handler(void);
void SysTick_Handler(void)
{
    s_osaState.tickCounter++;
}
#endif
